Revit 2024 API
BuiltInFailures.EditingFailures.InvalidArrayObject Property
 Some or all of the selected objects can't be created in an Array (for example, a Camera object for a 3D View).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidArrayObject { get; }
Visual Basic
Public Shared ReadOnly Property InvalidArrayObject As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidArrayObject {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace